mappings/uat/api_soap.json

{
  "request": {
    "url": "/api/soap",
    "method": "POST",
	"headers": {
      "Content-Type": {
        "equalTo": "text/xml; charset=UTF-8"
      }
    },
	"bodyPatterns": [
	    { "equalToXml": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\"><ubiNum>500</ubiNum></NumberToWords></soap:Body></soap:Envelope>" }
	 ]
  },
  "response": {
    "status": 200,
    "bodyFileName": "response.xml",
    "headers": {
      "Content-Type": "text/xml; charset=utf-8"
    }
  }
}
